<?php
if(!isset($_SESSION)){
session_start();
}
?>
<br><br><br><br><br>
<!-- むりやり改行してます -->

<!-- <h1><img src="./images/garage/simple_logo.jpg" alt="ロゴマーク"></h1> -->
<h1>プライバシーポリシー</h1>
<br>
<p>
サイトのプライバシー ポリシーについて<br>
プライバシー ポリシーには次の情報を記載する必要があります。<br><br>

Googleを含む第三者配信事業者はCookieを使用して、当ウェブサイトへの過去のアクセス情報に基づいて広告を配信します。<br>
DoubleClickCookieを使用することにより、GoogleやGoogleのパートナーは当サイトや他のサイトへのアクセス情報に基づいて、適切な広告をユーザーに表示できます。<br>
ユーザーは広告設定で、インタレストベースでの広告掲載に使用される DoubleClickCookieを無効にできます（また、aboutads.info ページでは、インタレストベースでの広告掲載に使用される第三者配信事業者のCookieを無効にできます）。<br><br>
第三者配信による広告掲載を無効化していない場合は、サイトへの広告配信にGoogle以外の第三者配信事業者や広告ネットワークのCookieも使用される可能性があるため、その点についても次の方法でサイトのプライバシー ポリシーに明示する必要があります。<br>
第三者配信事業者や広告ネットワークの配信する広告がサイトに掲載されることをユーザーに明示します。<br>
配信事業者や広告ネットワークの適切なウェブサイトへのリンクを設定します。<br>
これらのウェブサイトにアクセスすればインタレストベースでの広告掲載に使用されるCookieを無効にできることをユーザーに明示します（配信事業者や広告ネットワークがこの機能を提供している場合）。または、aboutads.info ページにアクセスすれば、第三<br>者配信事業者がインタレストベースでの広告掲載に使用するCookieを無効にできること をユーザーに案内します。<br>
</p>