
<div class="search-container">
<h1>結果</h1>
<div id="map_canvas"></div>           <!-- マップの表示場所 -->
  <button>条件を変える</button>
  <ul>
    <li class="">
      <div class="result-view">
      <a href="#modal" class="modal">
        <h2>ステーションシティ西梅田駐車場 駐輪場</h2>
        <p>〒530-0001 大阪府大阪市北区梅田３丁目２−１８</p>

        <h2>大和ハウス大阪ビル地下パーキング</h2>
        <p>〒530-0001 大阪府大阪市北区梅田３丁目３−５</p>

        <h2>ハービスOSAKA駐車場</h2>
        <p>〒530-0001 大阪府大阪市北区梅田２丁目５−２５</p>

        <h2>THE PARKing 明治安田生命大阪梅田ビル</h2>
        <p>〒530-0001 大阪府大阪市北区梅田３丁目3−20</p>

        <h2>大阪ステーションシティ駐車場</h2>
        <p>〒530-0001 大阪府大阪市北区梅田３丁目２</p>

        <h2>第二吉本ビル駐車場（屋内駐車場）</h2>
        <p>〒530-0001 大阪府大阪市北区梅田2丁目２−２ B3F</p>

        <h2>Dパーキング大阪マルビル（屋内駐車場）</h2>
        <p>〒530-0001 大阪府大阪市北区梅田１丁目９</p>

        <h2>大阪駅前駐車場</h2>
        <p>〒530-0001 大阪府大阪市北区梅田１丁目２</p>

        <h2>大阪駅前第２ビル地下駐車場</h2>
        <p>〒530-0001 大阪府大阪市北区梅田１丁目２−２</p>

        <h2>大阪駅前第３ビル地下駐車場</h2>
        <p>〒530-0001 大阪府大阪市北区梅田１丁目１−１−３</p>

        <h2>大阪駅前第４ビル地下駐車場</h2>
        <p>〒530-0001 大阪府大阪市北区梅田１丁目１１−４</p>

      </a>
      </div>
    </li>
  </ul>
</div>

<div>
  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>ステーションシティ西梅田駐車場 駐輪場</h3>
  <p>〒530-0001 大阪府大阪市北区梅田３丁目２−１８</p>
  <h2>・料金表</h2>
  <p>[6:00～23:59]</p>
  <p>全日：30分/310円　最大料金2,480円（入庫から24時間）</p>
  <p>[0:00～5:59]</p>
  <p>全日：60分/110円　最大料金2,480円（入庫から24時間）</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,240</h1>
  

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>大和ハウス大阪ビル地下パーキング</h3>
  <p>〒530-0001 大阪府大阪市北区梅田３丁目３−５</p>
  <h2>・料金表</h2>
  <p>[7:00〜21:00]</p>
  <p>全日：30分200円</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥800</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>ハービスOSAKA駐車場</h3>
  <p>〒530-0001 大阪府大阪市北区梅田２丁目５−２５</p>
  <h2>・料金表</h2>
  <p>[6:30～24:30（年中無休）]</p>
  <p>全日：30分/300円</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,200</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>THE PARKing 明治安田生命大阪梅田ビル</h3>
  <p>〒530-0001 大阪府大阪市北区梅田３丁目２−１８</p>
  <h2>・料金表</h2>
  <p>[7:30〜23:00]</p>
  <p>全日：30分¥300　 最大料金2,200円</p>
  <p>[22:30～8:00]</p>
  <p>宿泊料金：¥1000</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,200</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>大阪ステーションシティ駐車場</h3>
  <p>〒530-0001 大阪府大阪市北区梅田2丁目２−２ B3F</p>
  <h2>・料金表</h2>
  <p>[7:00〜24:00]</p>
  <p>全日 終日 30/300円</p>
  <p>[0:00-7:00]</p>
  <p>全日：2,700円</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,200</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>第二吉本ビル駐車場（屋内駐車場）</h3>
  <p>〒530-0001 大阪府大阪市北区梅田３丁目２−１８</p>
  <h2>・料金表</h2>
  <p>[6:00～23:59]</p>
  <p>全日：30分/310円　最大料金2,480円（入庫から24時間）</p>
  <p>[0:00～5:59]</p>
  <p>全日：60分/110円　最大料金2,480円（入庫から24時間）</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,240</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>Dパーキング大阪マルビル（屋内駐車場）</h3>
  <p>〒530-0001 大阪府大阪市北区梅田１丁目９</p>
  <h2>・料金表</h2>
  <p>[7:00-22:00]</p>
  <p>平日：20分/300円　最大料金1,800円（入庫から10時間）</p>
  <p>[0:00～5:59]</p>
  <p>土日祝：20分/300円　最大料金2,500円（入庫から10時間）</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,240</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>大阪駅前駐車場</h3>
  <p>〒530-0001 大阪府大阪市北区梅田１丁目２</p>
  <h2>・料金表</h2>
  <p>[6:00～23:00]</p>
  <p>平日：60分/600円　最大料金2,100円</p>
  <p>土日祝：20分/200円　最大料金2,800円</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,200</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>大阪駅前第２ビル地下駐車場</h3>
  <p>〒530-0001 大阪府大阪市北区梅田１丁目２−２</p>
  <h2>・料金表</h2>
  <p>[6:00〜23:00]</p>
  <p>平日：30分/300円　最大料金2,100円（入庫から3時間30分以上）</p>
  <p>土日祝：30分/300円　最大料金2,500円（入庫から4時間30分以上）</p>
  <p>[23:00〜6:00]</p>
  <p>駐泊：2,100円</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,200</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>大阪駅前第３ビル地下駐車場</h3>
  <p>〒530-0001 大阪府大阪市北区梅田１丁目１１−３</p>
  <h2>・料金表</h2>
  <p>[6:00〜23:00]</p>
  <p>平日：30分/300円　最大料金2,100円（入庫から3時間30分以上）</p>
  <p>土日祝：30分/300円　最大料金2,500円（入庫から4時間30分以上）</p>
  <p>[23:00〜6:00]</p>
  <p>駐泊：2,100円</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,200</h1>

  <h1>最終画面</h1>
  <h2>・駐車場場所</h2>
  <h3>Dパーキング大阪マルビル（屋内駐車場）</h3>
  <p>〒530-0001 大阪府大阪市北区梅田１丁目９</p>
  <h2>・料金表</h2>
  <p>[6:00-23:00]</p>
  <p>平日：30分/300円　最大料金2,400円（入庫から4時間以上）</p>
  <p>土日祝：30分/300円　最大料金2,800円（入庫から4時間30分以上）</p>
  <p>[23:00〜6:00]</p>
  <p>駐泊：2,100円</p>
  <h2>・予約時間</h2>
  <p>2020/03/06</p>
  <p>19:00〜21:00</p>
  <h1>合計　¥1,200</h1>

</div>

<script async defer src="https://maps.googleapis.com/maps/api/js?key=AIzaSyBuEn2XVwvjEUqlhcSa2fzCFgV3MtBhpBY&callback=initMap"></script>
<script type="text/javascript">
  var map;
  var marker = [];
  var infoWindow = [];
  // マーカーに設定するタイトル・緯度・経度・内容
  var markerData = [ {
      title: 'ステーションシティ西梅田駐車場 駐輪場',
      lat: 34.700376,
      lng: 135.493436,
      content: 'ステーションシティ西梅田駐車場 駐輪場 <br> 〒530-0001 大阪府大阪市北区梅田３丁目２−１８'

}, {
      title: '大和ハウス大阪ビル地下パーキング',
      lat: 34.699429,
      lng: 135.492616,
      content: '大和ハウス大阪ビル地下パーキング <br> 〒530-0001 大阪府大阪市北区梅田３丁目３−５'
    },{
      title: 'ハービスOSAKA駐車場',
      lat: 34.698841,
      lng: 135.492794,
      content: 'ハービスOSAKA駐車場 <br> 〒530-0001 大阪府大阪市北区梅田２丁目５−２５'
    },{
      title: 'THE PARKing 明治安田生命大阪梅田ビル',
      lat: 34.698613,
      lng: 135.491198,
      content: 'THE PARKing 明治安田生命大阪梅田ビル <br> 〒530-0001 大阪府大阪市北区梅田３丁目３−２０'
    },{
      title: '大阪ステーションシティ駐車場',
      lat: 34.701679,
      lng: 135.490233,
      content: '大阪ステーションシティ駐車場 <br> 〒530-0001 大阪府大阪市北区梅田３丁目２'
    },{
      title: '第二吉本ビル駐車場（屋内駐車場）',
      lat: 34.699768,
      lng: 135.495264,
      content: '第二吉本ビル駐車場（屋内駐車場） <br> 〒530-0001 大阪府大阪市北区梅田２丁目２−２ B3F'
    },{
      title: 'Dパーキング大阪マルビル（屋内駐車場）',
      lat: 34.699784,
      lng: 135.496677,
      content: 'Dパーキング大阪マルビル（屋内駐車場） <br> 〒530-0001 大阪府大阪市北区梅田１丁目９'
    },{
      title: '大阪駅前駐車場',
      lat: 34.699362,
      lng: 135.497678,
      content: '大阪駅前駐車場 <br> 〒530-0001 大阪府大阪市北区梅田１丁目２'
    },{
      title: '大阪駅前第２ビル地下駐車場',
      lat: 34.698854,
      lng: 135.498049,
      content: '大阪駅前第２ビル地下駐車場 <br> 〒530-0001 大阪府大阪市北区梅田１丁目２-２'
    },{
      title: '大阪駅前第３ビル地下駐車場',
      lat: 34.698862,
      lng: 135.49924,
      content: '大阪駅前第３ビル地下駐車場 <br> 〒530-0001 大阪府大阪市北区梅田１丁目１−１−３'
    },{
      title: '大阪駅前第４ビル地下駐車場',
      lat: 34.699859,
      lng: 135.498793,
      content: '大阪駅前第４ビル地下駐車場 <br> 〒530-0001 大阪府大阪市北区梅田１丁目１１−４'
    }];

 // 地図の作成
  function initMap() {
    // 緯度経度のデータ作成
    var mapLatLng = new google.maps.LatLng({lat: 34.699875, lng: 135.493032});
    // 地図の基本設定
    map = new google.maps.Map(document.getElementById('map_canvas'), {
      center: mapLatLng, // 地図の中心座標を指定
      zoom: 17, // 地図のデフォルトのズーム指定
      mapTypeId: google.maps.MapTypeId.ROADMAP // マップの表示種別選択 (ROADMAP・SATELLITE・TERRAIN・HYBRIDから選択)
    });
    
    // マーカー毎の処理
    for (var i = 0; i < markerData.length; i++) {
      // 緯度経度のデータを作成
      markerLatLng = new google.maps.LatLng({lat: markerData[i]['lat'], lng: markerData[i]['lng']});
      marker[i] = new google.maps.Marker({
        position: markerLatLng, // マーカーを立てる位置を指定
        map: map, // マーカーを立てる地図を指定
        title: markerData[i]['title'] // ツールヒント
      });
      
      // 吹き出しの設定
      infoWindow[i] = new google.maps.InfoWindow({
        // 吹き出しに表示する内容を設定する
        content: markerData[i]['content']
      });
      
      // マーカーにクリックイベントを追加
      markerEvent(i);
    }
  }
   
  // マーカーにクリックイベントを追加
  function markerEvent(i) {
      marker[i].addListener('click', function() {
        // 吹き出しの表示
        infoWindow[i].open(map, marker[i]);
    });
  }
</script>

